vendor/gems/connect_vbms/spec/fixtures/plaintext_unicode_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://vbms.vba.va.gov/external/eDocumentService/v4">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:getDocumentTypes>Hi mom.💩</v4:getDocumentTypes>
   </soapenv:Body>
</soapenv:Envelope>
