src/templates/list_documents_xml_template.xml.erb

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://vbms.vba.va.gov/external/eDocumentService/v4">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:listDocuments>
        <v4:fileNumber><%= file_number %></v4:fileNumber>
      </v4:listDocuments>
   </soapenv:Body>
</soapenv:Envelope>
